0.57.2119-1/Catalogs/ККСНГ_Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДоступаAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодпискиСК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногопользовательскийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемыйМодуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикПослеФормированияЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАвторизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючДоступаAPI</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Enums/ККСНГ_СпособыАвторизацииКурьер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ККСНГ_СпособыАвторизацииКурьер</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ApiKey</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТокенСбербанка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ККСНГ_Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникБанкаEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ3</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоговорыУВХД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорУВХД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_ЭлектронныеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Организации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОткрытаМастеромОрганизации", ОткрытаМастеромОрганизации);
	
	// Варианты отправки МЧД 
	СписокВариантовОтправки = Элементы.ВариантОтправкиМЧД.СписокВыбора;
	ВариантОтправкиМЧД = ККСНГ_МашиночитаемыеДоверенности.ДоступныеВариантыОтправкиДоверенности();
	
	СписокВариантовОтправки.Очистить();
	
	Для каждого ДоступныйВариант Из ВариантОтправкиМЧД Цикл
		СписокВариантовОтправки.Добавить(ДоступныйВариант.Значение, ДоступныйВариант.Представление);
	КонецЦикла;
	
	Если СписокВариантовОтправки.НайтиПоЗначению(Объект.ВариантОтправкиМЧД) = Неопределено Тогда
		Объект.ВариантОтправкиМЧД = "Метаданные";
	КонецЕсли;
	
	// Варианты настроек обмена ФНС
	ВариантыНастроекОбмена = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВариантыФорматовЭлектронныхДокументов();
	Для каждого НекийФормат Из ВариантыНастроекОбмена Цикл
		Элементы.СписокВариантовНастроекОбмена.СписокВыбора.Добавить(НекийФормат);
	КонецЦикла;
	Объект.ВариантНастройкиОбмена = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьДоступныйФорматЭлектронногоДокумента(Объект.ВариантНастройкиОбмена);
	
	// Таблица форматов ФНС
	ТаблицаФорматов = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьФорматыЭлектронныхДокументов();
	ИсходящиеДокументы.Загрузить(ТаблицаФорматов);
	
	ВариантНастройкиОтбора = ?(ЗначениеЗаполнено(Объект.ВариантНастройкиОбмена), Объект.ВариантНастройкиОбмена, "_");
	Отбор = Новый ФиксированнаяСтруктура("НаименованиеВарианта", ВариантНастройкиОтбора);
	Элементы.ИсходящиеДокументы.ОтборСтрок = Отбор;
	
	Если Не Отказ И ЗначениеЗаполнено(Объект.Организация) И Не ККСНГ_ОбщегоНазначенияВызовСервера.ОрганизацияДоступнаПользователю(Объект.Организация) Тогда
		Отказ = Истина;
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя недостаточно прав для совершения операции.");
	КонецЕсли;
	
	ТекущийСпособАвторизации = ККСНГ_ДокументооборотВызовСервера.СпособАвторизацииОрганизации(Объект.Ссылка);
	
	// Устанавливаем ограничение типов для реквизитов
	МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	
	Если Не МодульККСНГ_ПМ_РаботаСМетаданными = Неопределено Тогда
		МодульККСНГ_ПМ_РаботаСМетаданными.УстановитьОграничениеТипа(Элементы.Склад, "Склады");
		Элементы.Склад.Видимость = Элементы.Склад.ОграничениеТипа.Типы().Количество();
	КонецЕсли;
	
	ОбновитьНастройкуПодключаемогоМодуля();
	ЗаполнитьРеквизитыФормыПоРегламентномуЗаданию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ТекущийВариантНастройкиОбмена) Тогда
		ТекущийВариантНастройкиОбмена = Объект.ВариантНастройкиОбмена;
	КонецЕсли;
		
	МногопользовательскийРежимПриОткрытии = Объект.МногопользовательскийРежим;
	
	НастроитьПерейтиКНастройкамКонтрагентов();
	ОбновитьВидимостьПоСпособуАвторизации();
	ОбновитьВидимостьМногопользовательскогоРежима();
	 
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Склад) Тогда
		Попытка
			ЭтотОбъект.Склад = Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойстваОсновнойКонфигурации(ТекущийОбъект, "Склад");
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Склад", ЭтотОбъект.Склад);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.МногопользовательскийРежим Тогда
	
		Инд = 0;		
		Для Каждого СтрокаНастройкиДоступа Из Объект.НастройкиДоступа Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаНастройкиДоступа.СпособАвторизации) Тогда
				
					ТекстСообщенияПользователю = "Не заполнена колонка ""Способ авторизации"" в строке " + Строка(Инд + 1) + " списка ""Настройки доступа""";
					КлючДанных = Объект.Ссылка;
					Поле = "НастройкиДоступа[" + Строка(Инд) + "].СпособАвторизации";
					ПутьКДанным = "Объект";
					ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю, КлючДанных, Поле, ПутьКДанным, Отказ);
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаНастройкиДоступа.Пользователь1С) Тогда
				
					ТекстСообщенияПользователю = "Не заполнена колонка ""Пользователь"" в строке " + Строка(Инд + 1) + " списка ""Настройки доступа""";
					КлючДанных = Объект.Ссылка;
					Поле = "НастройкиДоступа[" + Строка(Инд) + "].Пользователь1С";
					ПутьКДанным = "Объект";
					ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю, КлючДанных, Поле, ПутьКДанным, Отказ);
				
			КонецЕсли;
							
			Если НЕ ЗначениеЗаполнено(СтрокаНастройкиДоступа.КлючДоступаAPI) 
				И СтрокаНастройкиДоступа.СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ApiKey") Тогда
				
					ТекстСообщенияПользователю = "Не заполнена колонка ""Ключ доступа API"" в строке " + Строка(Инд + 1) + " списка ""Настройки доступа""";
					КлючДанных = Объект.Ссылка;
					Поле = "НастройкиДоступа[" + Строка(Инд) + "].КлючДоступаAPI";
					ПутьКДанным = "Объект";
					ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю, КлючДанных, Поле, ПутьКДанным, Отказ);
				
			КонецЕсли;		
			
			Инд = Инд + 1;
			
		КонецЦикла;
		
		Если НЕ Объект.НастройкиДоступа.Количество() Тогда
			
			ТекстСообщенияПользователю = "Табличная часть списка ""Настройки доступа"" должна содержать хотя бы одну запись";
			КлючДанных = Объект.Ссылка;
			Поле = "НастройкиДоступа";
			ПутьКДанным = "Объект";
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю, КлючДанных, Поле, ПутьКДанным, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ТекущийВариантНастройкиОбмена <> Объект.ВариантНастройкиОбмена Тогда
		ПараметрыСобытия = Новый Структура;
		ПараметрыСобытия.Вставить("ПрофильЭДООрганизации", Объект.Ссылка);
		ПараметрыСобытия.Вставить("КодУчастникаЭДООрганизации", Объект.КодУчастникаЭДО);
		ПараметрыСобытия.Вставить("НовыйВариантНастройкиОбмена", Объект.ВариантНастройкиОбмена);
		Оповестить("ОбновитьКОтправке", ПараметрыСобытия, ЭтотОбъект);  
		ТекущийВариантНастройкиОбмена = Объект.ВариантНастройкиОбмена;
	КонецЕсли;

	СпособАвторизацииПослеЗаписи = ККСНГ_ДокументооборотВызовСервера.СпособАвторизацииОрганизации(Объект.Ссылка);
	
	Если ТекущийСпособАвторизации <> СпособАвторизацииПослеЗаписи Тогда
		Если глПараметрыАвторизацииКурьер <> Неопределено Тогда
			глПараметрыАвторизацииКурьер.Вставить(Объект.Ссылка, Неопределено);
		КонецЕсли;			
		ТекущийСпособАвторизации = СпособАвторизацииПослеЗаписи;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если НЕ ЭтотОбъект.Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ККСНГ_ИзменениеНастроекАвтообмена" 
		И ТипЗнч(Параметр) = Тип("СправочникСсылка.ККСНГ_Организации") Тогда
		
		ЗаполнитьРеквизитыФормыПоРегламентномуЗаданию()
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиДоступа

&НаКлиенте
Процедура НастройкиДоступаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Объект.НастройкиДоступа.Количество() ИЛИ Копирование Тогда
		Отказ = Истина;
		
		Если Копирование Тогда		
			ДанныеДляСтроки = Элемент.ТекущиеДанные;
		Иначе
			ДанныеДляСтроки = Объект;
		КонецЕсли;
				
		НоваяСтрока = Объект.НастройкиДоступа.Добавить();
		НоваяСтрока.СпособАвторизации = ДанныеДляСтроки.СпособАвторизации;
		Если ДанныеДляСтроки.СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ApiKey") Тогда
			НоваяСтрока.КлючДоступаAPI = ДанныеДляСтроки.КлючДоступаAPI;
		КонецЕсли;
				
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДоступаПользователь1СОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		
	Отбор = Новый Структура;
	Отбор.Вставить("Пользователь1С", ВыбранноеЗначение);
	НайденныеСтроки = Объект.НастройкиДоступа.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() Тогда
		СтандартнаяОбработка = Ложь;
		ТекстСообщенияПользователю = "Пользователь " + ВыбранноеЗначение + " уже присутствует в строке "
								+ Строка(НайденныеСтроки[0].НомерСтроки) + " списка ""Настройки доступа""";
		КлючДанных = Объект.Ссылка;
		Поле = "НастройкиДоступа[" + Строка(НайденныеСтроки[0].НомерСтроки - 1) + "].Пользователь1С";
		ПутьКДанным = "Объект";
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю, КлючДанных, Поле, ПутьКДанным);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДоступаСпособАвторизацииПриИзменении(Элемент)
	ОбновитьВидимостьМногопользовательскогоРежима();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособАвторизацииПриИзменении(Элемент)
	ОбновитьВидимостьПоСпособуАвторизации();
КонецПроцедуры

&НаКлиенте
Процедура СписокВариантовНастроекОбменаПриИзменении(Элемент)
		
	ВариантНастройкиОтбора = ?(ЗначениеЗаполнено(Объект.ВариантНастройкиОбмена), Объект.ВариантНастройкиОбмена, "_");
	Отбор = Новый ФиксированнаяСтруктура("НаименованиеВарианта", ВариантНастройкиОтбора);
	Элементы.ИсходящиеДокументы.ОтборСтрок = Отбор;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкамКонтрагентовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ПрофильЭДООрганизации", Объект.Ссылка);
	ОткрытьФорму("Обработка.ККСНГ_СинхронизацияКонтрагентов.Форма.Синхронизация", ПараметрыФормы, , Объект.Ссылка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьМногопользовательскийРежим(Команда)
			
	Объект.МногопользовательскийРежим = НЕ Объект.МногопользовательскийРежим;
	ОбновитьВидимостьМногопользовательскогоРежима();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестНастроек(Команда)
	
	ТестДоступен = Истина;
	
	Если Объект.СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ApiKey") Тогда
		ТестДоступен = ЗначениеЗаполнено(Объект.КлючДоступаAPI);	
	КонецЕсли;
	
	Если ТестДоступен Тогда
		СтарыйКодУчастника = Объект.КодУчастникаЭДО;
		СтарыйИдентификаторПодписки = Объект.ИдентификаторПодпискиСК;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("СтарыйКодУчастника", СтарыйКодУчастника);
		ДопПараметры.Вставить("СтарыйИдентификаторПодписки", СтарыйИдентификаторПодписки);
		ПослеТестаНастроек = Новый ОписаниеОповещения("УстановитьМодифицированность", ЭтотОбъект, ДопПараметры);
		НачатьТестНастроек(ПослеТестаНастроек);		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура НастроитьРасписаниеАвтообмена(Команда)
	
	Перем ПараметрыОткрытияФормы, ТекстВопроса;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		Или ЭтотОбъект.Модифицированность Тогда
		
		ОчиститьСообщения();
		
		ТекстВопроса = "Для перехода в настройки расписания автообмена необходимо сохранить изменения.
		|Записать элемент?";
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьОтветПользователяОЗаписиОбъекта", ЭтотОбъект),
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет);
		
	Иначе 
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("ОрганизацияЭДО", 	Объект.Ссылка);
		
		ОткрытьФорму("Справочник.ККСНГ_Организации.Форма.ФормаНастройкиРасписанияАвтообмена", 
						ПараметрыОткрытияФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НастроитьМЧД(Команда)
	
	Перем ПараметрыОткрытияФормы, ТекстВопроса;

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или ЭтотОбъект.Модифицированность Тогда
		
		ОчиститьСообщения();
		
		ДополнительныеПараметры = Новый Структура("КомандаНастройкиМЧД", Команда);
		
		ТекстВопроса = "Для перехода в настройки машиночитаемой доверенности необходимо сохранить изменения.
		|Записать элемент?";
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьОтветПользователяОЗаписиОбъекта", ЭтотОбъект, ДополнительныеПараметры), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("ОрганизацияЭДО", Объект.Ссылка);
		
		ОткрытьФорму("Справочник.ККСНГ_МашиночитаемыеДоверенности.Форма.ФормаСписка", ПараметрыОткрытияФормы, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьШаблонОбработчика(Команда)
	
	ОписаниеФайлаШаблона = ПодготовитьШаблонОбработчикаНаСервере();
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(ОписаниеФайлаШаблона);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.Заголовок = "Сохранение шаблона обработки электронного документа";
	ДиалогВыбораФайла.ПолноеИмяФайла = ОписаниеФайлаШаблона.Имя;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьСохранениеШаблона", ЭтотОбъект, ДиалогВыбораФайла);
	НачатьПолучениеФайлов(ОписаниеОповещения, МассивФайлов, ДиалогВыбораФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьШаблон(Команда)
	
	ЭтотОбъект.Модифицированность = Истина;
	Объект.ОбработчикПослеФормирования = Неопределено;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработатьОтветПользователяОЗаписиОбъекта(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	КомандаНастройкиМЧД = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "КомандаНастройкиМЧД");
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать();
		
		Если КомандаНастройкиМЧД <> Неопределено Тогда
			НастроитьМЧД(КомандаНастройкиМЧД);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьПоСпособуАвторизации()
	
	АвторизацияApiKey = Объект.СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ApiKey");
	Элементы.КлючДоступаAPI.Видимость = АвторизацияApiKey;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьМногопользовательскогоРежима()
	
	ТекущийРежим = Объект.МногопользовательскийРежим;		
	Элементы.СтраницаНастройкиДоступаМногопользовательскийРежим.Видимость = ТекущийРежим;
	Элементы.СтраницаНастройкиДоступа.Видимость = НЕ ТекущийРежим;
	
	Если Не Объект.МногопользовательскийРежим Тогда
		ОбновитьВидимостьПоСпособуАвторизации();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМодифицированность(Результат, ДопПараметры) Экспорт
	
	СтарыйКодУчастника = ДопПараметры.СтарыйКодУчастника;
	СтарыйИдентификаторПодписки = ДопПараметры.СтарыйИдентификаторПодписки;
	Если СтарыйКодУчастника <> Объект.КодУчастникаЭДО
	 ИЛИ СтарыйИдентификаторПодписки <> Объект.ИдентификаторПодпискиСК Тогда		
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьНастроенныеКонтрагенты(ПрофильЭДООрганизации)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ККСНГ_Контрагенты.Ссылка КАК КонтрагентСсылка
		|ИЗ
		|	Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
		|ГДЕ
		|	ККСНГ_Контрагенты.Владелец = &ПрофильЭДООрганизации
		|	И НЕ ККСНГ_Контрагенты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
		
КонецФункции

&НаКлиенте
Процедура НастроитьПерейтиКНастройкамКонтрагентов()
	
	Элементы.ПерейтиКНастройкамКонтрагентов.Заголовок = ККСНГ_ДокументооборотКлиент.ТекстОбОтсутствииКонтрагентовЭДО(ОткрытаМастеромОрганизации);
	Элементы.ПерейтиКНастройкамКонтрагентов.Видимость = Не ЕстьНастроенныеКонтрагенты(Объект.Ссылка);
	
КонецПроцедуры

#Область НастройкаРегламентныхЗаданий

// Получает данные регламентного задания (если оно есть) и заполняет форму данными задания.
&НаСервере
Процедура ЗаполнитьРеквизитыФормыПоРегламентномуЗаданию()
	
	Перем НастройкиРегламентногоЗадания;
	
	ЧтениеНастроек = ККСНГ_РегламентныеЗадания.ПрочитатьНастройкиРегламентногоЗаданияАвтообмена(Объект.Ссылка);
	
	Если ЧтениеНастроек.Успех Тогда
		
		НастройкиРегламентногоЗадания = ЧтениеНастроек.Результат;
		
		ЭтотОбъект.Использование = НастройкиРегламентногоЗадания.Использование;
		ЭтотОбъект.РасписаниеРегламентногоЗадания = НастройкиРегламентногоЗадания.Расписание;
		ЭтотОбъект.ПользовательЭДО = НастройкиРегламентногоЗадания.ПользовательЭДО;
		
	КонецЕсли;
	
	Если ТипЗнч(ЭтотОбъект.РасписаниеРегламентногоЗадания) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		ЭтотОбъект.РасписаниеРегламентногоЗадания = "Не установлено";
	КонецЕсли;

	ЭтотОбъект.Элементы.ПользовательЭДО.Доступность = ЗначениеЗаполнено(ЭтотОбъект.ПользовательЭДО);
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ПользовательЭДО) Тогда
		ЭтотОбъект.ПользовательЭДО = "Не указан";
	КонецЕсли;
	
	ЭтотОбъект.Элементы.РасписаниеАвтоматическогоОбменаИнформация.Доступность = ЭтотОбъект.Использование;
	
КонецПроцедуры

#КонецОбласти

#Область ТестированиеНастроек

&НаКлиенте
Процедура НачатьТестНастроек(ПослеТестаНастроек)
	
	ККСНГ_ДокументооборотКлиент.ИнициализироватьПараметрыАвторизации();
	ТекПараметрыАвторизации = ККСНГ_ДокументооборотКлиент.ТекущиеПараметрыАвторизацииОрганизации(Объект.Ссылка);
	Если ТекПараметрыАвторизации <> Неопределено И ТекПараметрыАвторизации.СпособАвторизации = Объект.СпособАвторизации Тогда
		ПродолжитьТестНастроек(ТекПараметрыАвторизации, ПослеТестаНастроек);
	Иначе 	
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ОповещениеОЗавершении", ПослеТестаНастроек);
		НачатьАутентификацию(ТекПараметрыАвторизации, ДопПараметры);
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НачатьАутентификацию(ПараметрыАвторизации, ДополнительныеПараметры)
	
	ДанныеАвторизации = Новый Структура("СпособАвторизации,КлючДоступаAPI,ПараметрыАвторизации",
							Объект.СпособАвторизации, Объект.КлючДоступаAPI, ПараметрыАвторизации);
	ЗавершениеАутентификации = Новый ОписаниеОповещения("ЗавершениеАутентификации", ЭтотОбъект, ДополнительныеПараметры);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииНовойОрганизации(ДанныеАвторизации, ЗавершениеАутентификации);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеАутентификации(Результат, ДополнительныеПараметры) Экспорт
		
	ОповещениеОЗавершении = ДополнительныеПараметры.ОповещениеОЗавершении;
	Если Результат.Успех Тогда
		ПараметрыАвторизации = Результат.Результат;
		глПараметрыАвторизацииКурьер.Вставить(Объект.Ссылка, ПараметрыАвторизации);
		ПродолжитьТестНастроек(ПараметрыАвторизации, ОповещениеОЗавершении);
	Иначе 
		ТекстОшибки = "Не удалось авторизоваться. " + ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Результат.Журнал);
		Если Не ПустаяСтрока(ТекстОшибки) Тогда
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьТестНастроек(ПараметрыАвторизации, ОповещениеОЗавершении)
	
	РезультатТеста = ТестНастроекНаСервере(ПараметрыАвторизации, Объект.ИдентификаторПодпискиСК);
	
	ПолученныеДанные = РезультатТеста.ВозвращаемыеДанные;
	Если ЗначениеЗаполнено(ПолученныеДанные.КодУчастникаЭДО) Тогда
		Объект.КодУчастникаЭДО = ПолученныеДанные.КодУчастникаЭДО;
		ККСНГ_ОбщегоНазначенияКлиентСервер.ФорматироватьКодУчастникаЭДО(Объект.КодУчастникаЭДО);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПолученныеДанные.ИдентификаторСК) Тогда
		Объект.ИдентификаторСК = ПолученныеДанные.ИдентификаторСК;
	КонецЕсли;
	Если РезультатТеста.Успех Тогда
		Объект.ИдентификаторПодпискиСК = ПолученныеДанные.ИдентификаторПодпискиСК;
	КонецЕсли;
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатТеста.Комментарий);
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, РезультатТеста);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТестНастроекНаСервере(ПараметрыАвторизации, ИдентификаторПодпискиСК)
	
	РезультатТеста = Новый Структура;	
	РезультатТеста.Вставить("ВозвращаемыеДанные", Новый Структура("КодУчастникаЭДО,ИдентификаторСК,ИдентификаторПодпискиСК"));
	РезультатТеста.Вставить("Успех", Ложь);
	РезультатТеста.Вставить("Комментарий", "");

	РезультатВызова = ККСНГ_APIКурьер.v2_ClientSelf(ПараметрыАвторизации);
	
	Если РезультатВызова.Успех Тогда
		
		Company = РезультатВызова.Результат;
		РезультатТеста.ВозвращаемыеДанные.КодУчастникаЭДО = Company.Code;
		РезультатТеста.ВозвращаемыеДанные.ИдентификаторСК = Company.Id;
		
		РезультатВызова = ККСНГ_ДокументооборотВызовСервера.ПолучитьИдентификаторПодписки(ИдентификаторПодпискиСК, ПараметрыАвторизации);
		
		Если РезультатВызова.Успех Тогда
			
			РезультатТеста.ВозвращаемыеДанные.ИдентификаторПодпискиСК = РезультатВызова.Результат;
			РезультатТеста.Успех = Истина;
			РезультатТеста.Комментарий = "Тест настроек прошел успешно.";
			
		Иначе
			РезультатТеста.Комментарий = ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(РезультатВызова.Журнал, "SC-00001");
		КонецЕсли;
		
	Иначе	
		РезультатТеста.Комментарий = "Не удалось получить информацию о компании: " + ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(РезультатВызова.Журнал);
	КонецЕсли;
			
	Возврат РезультатТеста;
	
КонецФункции

&НаСервере
Процедура ОбновитьНастройкуПодключаемогоМодуля()
	
	Если ЗначениеЗаполнено(Объект.ОбработчикПослеФормированияЭД) И Не ЗначениеЗаполнено(Объект.ПодключаемыйМодуль) Тогда
		Объект.ПодключаемыйМодуль = Объект.ОбработчикПослеФормированияЭД;
		Объект.ОбработчикПослеФормированияЭД = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();
		ЭтотОбъект.Записать();
	КонецЕсли;
	
	Элементы.ГруппаОбработчикПосле.Видимость = Не Объект.ОбработчикПослеФормированияЭД.Пустая();
	
КонецПроцедуры

#Область РаботаСШаблономОбработки

&НаСервереБезКонтекста
Функция ПодготовитьШаблонОбработчикаНаСервере()
	
	ДвоичныеДанныеОбработки = ПолучитьОбщийМакет("ККСНГ_ПодключаемыйМодуль");
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеОбработки);
	ОписаниеФайл = Новый ОписаниеПередаваемогоФайла("ПодключаемыйМодульЭДО.epf", Адрес);
	
	Возврат ОписаниеФайл;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьСохранениеШаблона(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		
		КоличествоФайлов = Результат.Количество();
		
		Если КоличествоФайлов Тогда
			ТекстСообщения = "Шаблон обработчика сохранен " + ДопПараметры.Каталог;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПриНажатииНаВложения", ЭтотОбъект, ДопПараметры.Каталог);
			ПоказатьОповещениеПользователя(ТекстСообщения, ОписаниеОповещения, "Посмотреть в папке", БиблиотекаКартинок.СохранитьФайл);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриНажатииНаВложения(ДополнительныеПараметры) Экспорт
	
	#Если ВебКлиент Тогда
		Если Не РаботаСФайламиСлужебныйКлиент.РасширениеРаботыСФайламиПодключено() Тогда
			РаботаСФайламиСлужебныйКлиент.ПоказатьПредупреждениеОНеобходимостиРасширенияРаботыСФайлами(Неопределено);
			Возврат;
		КонецЕсли;
	#КонецЕсли

	Если ТипЗнч(ДополнительныеПараметры) = Тип("Строка") И Не ПустаяСтрока(ДополнительныеПараметры) Тогда
		ОбщегоНазначенияКлиент.ОткрытьПроводник(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
